mypkm/app/Models/AdminModel.php

    public function authenticate($username, $password)
    {
        $user = $this->where('username', $username)->first();
---
SELECT *
FROM `tb_admin`
WHERE `username` = 'admin'
 LIMIT 1