mypkm/app/Models/AkademikModel.php

    public function authenticate($username, $password)
    {
        $user = $this->where('username', $username)->first();
---
SELECT *
FROM `tb_akademik`
WHERE `username` = 'admin'
 LIMIT 1