Mypkm/app/Models/M_Mahasiswa.php

SELECT *
FROM `mahasiswa`
---
    public function getAllData()
    {
        return $this->db->table('mahasiswa')->get()->getResultArray();