mypkm/app/Models/MahasiswaModel.php

    public function authenticate($username, $password)
    {
        $hashedPassword = sha1($password);

        $user = $this->where('npm', $username)
            ->where('password', $hashedPassword)
            ->where('status_akun', 'aktif')
            ->first();
---
SELECT *
FROM `tb_mahasiswa`
WHERE `npm` = 'admin'
AND `password` = '7110eda4d09e062aa5e4a390b0a572ac0d2c0220'
AND `status_akun` = 'aktif'
 LIMIT 1