mypkm/app/Models/UsulanModel.php

SELECT `tb_usulan`.*, `tb_mahasiswa`.`npm`, `tb_mahasiswa`.`nama`
FROM `tb_usulan`
INNER JOIN `tb_mahasiswa` ON `tb_mahasiswa`.`id_mahasiswa` = `tb_usulan`.`id_mahasiswa`
WHERE `tb_usulan`.`id_mahasiswa` = '19'
---
    public function getDataJoinMahasiswa()
    {
        $id_mahasiswa = session('user')['id_mahasiswa']; // Ambil ID mahasiswa dari sesi

        $query = $this->db->table('tb_usulan');
        $query->select('tb_usulan.*, tb_mahasiswa.npm, tb_mahasiswa.nama');
        $query->join('tb_mahasiswa', 'tb_mahasiswa.id_mahasiswa = tb_usulan.id_mahasiswa', 'inner');
        $query->where('tb_usulan.id_mahasiswa', $id_mahasiswa); // Filter berdasarkan ID mahasiswa dari sesi

        $result = $query->get()->getResultArray();